Tekla.Structures.Plugins.SeamInputTypeAttribute
The SeamInputTypeAttribute class is used for identifying that the connection is a seam and defining the input type.
Based on the type the system will then ask for the correct number of input points in the creation.
The attribute is initialized from the custom attribute
[SeamInputType(ConnectionBase.SeamInputType.INPUT_POLYGON)]
in the connection source.

Tekla.Structures.Plugins.SeamInputTypeAttribute.#ctor(Tekla.Structures.Plugins.ConnectionBase.SeamInputType)
The custom attribute [SeamInputType()] uses this to store the input type to the system.
This is not to be used by itself.
Type: The seam input type.

Tekla.Structures.Plugins.SeamInputTypeAttribute.Type
The custom attribute [SeamInputType()] uses this to store the input type to the system.
This is not to be used by itself.

Tekla.Structures.Plugins.SeamInputTypeAttribute.#ctor(System.Int32)
The custom attribute [SeamInputType()] uses this to store the input type to the system.
This is not to be used by itself.
Type: The seam input type.